# IFC_DMGetObjNameAt

## Description
Returns the Object Name for specified index in IFC Data Mapping.

```pascal
FUNCTION IFC_DMGetObjNameAt(
				index                : INTEGER;
				VAR outStrObjectName : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMGetObjNameAt(index):
    return (BOOLEAN, outStrObjectName)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER||
|outStrObjectName|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* IFC